In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings
warnings.filterwarnings('ignore')

sns.set()

# Graphics in SVG format are more sharp and legible
#%config InlineBackend.figure_format = 'svg'

https://blog.csdn.net/youngbit007/article/details/54288603

### groupby

In [2]:

df = pd.DataFrame({'key1':list('aabba'),
                  'key2': ['one','two','one','two','one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.146428  0.465275
1    a  two -0.388883 -1.994468
2    b  one  0.507904 -0.107981
3    b  two -0.039762  0.521063
4    a  one  0.837846 -0.952123

In [3]:
grouped=df['data1'].groupby(df['key1'])
grouped.mean()

key1
a   -0.232488
b    0.234071
Name: data1, dtype: float64

In [4]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
years=np.array([2005,2005,2006,2005,2006])
df['data1'].groupby([states,years]).mean()

California  2005   -0.388883
            2006    0.507904
Ohio        2005   -0.593095
            2006    0.837846
Name: data1, dtype: float64

In [5]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.232488 -0.827106
b     0.234071  0.206541

In [6]:
for name, group in df.groupby('key1'):
    print (name)
    print (group)

a
  key1 key2     data1     data2
0    a  one -1.146428  0.465275
1    a  two -0.388883 -1.994468
4    a  one  0.837846 -0.952123
b
  key1 key2     data1     data2
2    b  one  0.507904 -0.107981
3    b  two -0.039762  0.521063

In [7]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print ('===k1,k2:')
    print (k1,k2)
    print ('===k3:')
    print (group)

===k1,k2:
a one
===k3:
  key1 key2     data1     data2
0    a  one -1.146428  0.465275
4    a  one  0.837846 -0.952123
===k1,k2:
a two
===k3:
  key1 key2     data1     data2
1    a  two -0.388883 -1.994468
===k1,k2:
b one
===k3:
  key1 key2     data1     data2
2    b  one  0.507904 -0.107981
===k1,k2:
b two
===k3:
  key1 key2     data1     data2
3    b  two -0.039762  0.521063

In [8]:
piece=dict(list(df.groupby('key1')))
piece['a']

  key1 key2     data1     data2
0    a  one -1.146428  0.465275
1    a  two -0.388883 -1.994468
4    a  one  0.837846 -0.952123

In [9]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.243424
     two  -1.994468
b    one  -0.107981
     two   0.521063

In [10]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=list('abcde'),
                   index=['Joe','Steve','Wes','Jim','Travis'])

people.ix[2:3,['b','c']]=np.nan #设置几个nan
people

               a         b         c         d         e
Joe     0.981028  0.329587  0.257731 -1.490666  1.661407
Steve   0.119611 -1.026487 -1.636603  1.307246  0.489000
Wes    -1.053318       NaN       NaN  0.307274  0.620180
Jim    -0.232073 -0.594606 -0.965417  0.293943  0.314926
Travis -1.444844 -0.265168 -1.398628  0.676334 -1.122627

In [11]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}
by_column=people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe    -1.232935  2.972023
Steve  -0.329357 -0.417876
Wes     0.307274 -0.433139
Jim    -0.671474 -0.511753
Travis -0.722294 -2.832639

In [12]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.304363 -0.265019 -0.707686 -0.889448  2.596513
5  0.119611 -1.026487 -1.636603  1.307246  0.489000
6 -1.444844 -0.265168 -1.398628  0.676334 -1.122627

In [13]:
key_list=['one','one','one','two','two'] 
people.groupby([len, key_list]).sum()

              a         b         c         d         e
3 one -0.072290  0.329587  0.257731 -1.183391  2.281587
  two -0.232073 -0.594606 -0.965417  0.293943  0.314926
5 one  0.119611 -1.026487 -1.636603  1.307246  0.489000
6 two -1.444844 -0.265168 -1.398628  0.676334 -1.122627

In [14]:
def peak_to_peak(arr):
    print(arr)
    return arr.max()

people.groupby(len).agg(peak_to_peak)

Joe    0.981028
Wes   -1.053318
Jim   -0.232073
Name: a, dtype: float64
Steve    0.119611
Name: a, dtype: float64
Travis   -1.444844
Name: a, dtype: float64
Joe    0.329587
Wes         NaN
Jim   -0.594606
Name: b, dtype: float64
Steve   -1.026487
Name: b, dtype: float64
Travis   -0.265168
Name: b, dtype: float64
Joe    0.257731
Wes         NaN
Jim   -0.965417
Name: c, dtype: float64
Steve   -1.636603
Name: c, dtype: float64
Travis   -1.398628
Name: c, dtype: float64
Joe   -1.490666
Wes    0.307274
Jim    0.293943
Name: d, dtype: float64
Steve    1.307246
Name: d, dtype: float64
Travis    0.676334
Name: d, dtype: float64
Joe    1.661407
Wes    0.620180
Jim    0.314926
Name: e, dtype: float64
Steve    0.489
Name: e, dtype: float64
Travis   -1.122627
Name: e, dtype: float64

          a         b         c         d         e
3  0.981028  0.329587  0.257731  0.307274  1.661407
5  0.119611 -1.026487 -1.636603  1.307246  0.489000
6 -1.444844 -0.265168 -1.398628  0.676334 -1.122627

### 根据索引级别进行分组
层次化索引最方便的地方就在于他能够根据索引级别进行聚合。要实现该目的，通过level关键字出入级别编号或者名称即可:

In [15]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['cty','tenor'])#二级列索引，并为每级索引命名
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.368094 -0.754675  1.367424  1.321038  0.056919
1     -0.150979 -0.348791 -0.597104 -0.554725 -0.629889
2      0.815330 -1.647823  0.864789  1.574903 -0.647782
3     -0.166700  0.553087  0.513381 -0.832304  1.147902

In [16]:
hier_df.groupby(level=['cty'],axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

### 分组级运算和转换

#### 聚合只是分组运算的一种，它是数据转换的特列。transform 和apply更牛叉.

transform会将一个函数应用到各个分组，然后将结果放在适当的位置. 如果各分组产生的标量值，则该标量值会被广播出去。

transform也是有严格条件的特殊函数：传入的函数只能产生两种结果，要么产生一个可以广播的标量值(如：np.mean), 要么产生一个相同大小的结果数组。

In [17]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=list('abcde'),
                   index=['Joe','Steve','Wes','Jim','Travis'])
people

               a         b         c         d         e
Joe    -2.864059  0.911290 -1.563713  0.051549  1.178953
Steve  -1.012821  1.678865  1.845972  1.719927 -0.142249
Wes    -0.826604  0.662447  0.368801  0.134887  0.106610
Jim     0.595662 -0.150429  0.749107 -0.841088 -0.288327
Travis  0.114293  1.759986 -0.393960  0.872841 -1.025013

In [18]:
key=['one','two','one','two','one']
people.groupby(key).mean()

            a         b         c         d         e
one -1.192123  1.111241 -0.529624  0.353092  0.086850
two -0.208580  0.764218  1.297540  0.439420 -0.215288

In [19]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -1.192123  1.111241 -0.529624  0.353092  0.086850
Steve  -0.208580  0.764218  1.297540  0.439420 -0.215288
Wes    -1.192123  1.111241 -0.529624  0.353092  0.086850
Jim    -0.208580  0.764218  1.297540  0.439420 -0.215288
Travis -1.192123  1.111241 -0.529624  0.353092  0.086850

In [20]:
def demean(arr):
    return arr-arr.mean()

demeaned=people.groupby(key).transform(demean)
demeaned

               a         b         c         d         e
Joe    -1.671936 -0.199951 -1.034089 -0.301543  1.092103
Steve  -0.804241  0.914647  0.548432  1.280508  0.073039
Wes     0.365519 -0.448794  0.898425 -0.218206  0.019760
Jim     0.804241 -0.914647 -0.548432 -1.280508 -0.073039
Travis  1.306416  0.648745  0.135664  0.519749 -1.111863

In [21]:
demeaned.groupby(key).mean()

                a             b    c    d             e
one  1.480297e-16  7.401487e-17  0.0  0.0  0.000000e+00
two  0.000000e+00  5.551115e-17  0.0  0.0 -1.387779e-17

### 最一般化的groupby 方法是apply.

In [ ]:
tips=pd.read_csv('C:\\Users\\ecaoyng\\Desktop\\work space\\Python\\py_for_analysis_code\\pydata-book-master\\ch08\\tips.csv')
tips[:5]

#### 新生成一列

In [ ]:
tips['tip_pct']=tips['tip']/tips['total_bill']
tips[:6]

#### 根据分组选出最高的5个tip_pct值

In [22]:
def top(df,n=5,column='tip_pct'):
    return df.sort_index(by=column)[-n:]

#### 对smoker分组并应用该函数

In [23]:
tips.groupby('smoker').apply(top)

NameError: name 'tips' is not defined

#### 多参数版本

In [ ]:
tips.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

### 分位数和桶分析

#### cut and qcut与groupby结合起来，能轻松的对数据集的桶(bucket)或者分位数(quantile)分析

In [29]:
frame=pd.DataFrame({'data1':np.random.randn(1000),
                   'data2': np.random.randn(1000)})
frame

        data1     data2
0   -0.812561 -1.578405
1    0.044304  1.690559
2   -1.677274 -0.018209
3    0.161797 -0.833046
4   -0.586280 -1.468072
5   -0.864907  1.195605
6    0.932888 -0.000990
7   -0.741454 -1.364302
8    0.701135  1.065377
9    1.267549  1.015130
10  -1.377327  0.345850
11   0.169294 -0.425137
12   0.933492  0.130095
13   0.873648 -0.489781
14   0.816105  0.216183
15   0.945202 -0.169485
16  -0.835631 -0.490745
17   1.411597  1.873096
18   0.102480  0.768610
19  -1.029092  0.354937
20  -0.876604  0.821373
21  -0.857197  0.232307
22   1.099550 -1.582225
23   1.706514  2.095481
24   0.775033 -0.157956
25   0.883762  0.064423
26  -1.337642 -0.761180
27  -0.759219 -1.681603
28   0.734996  0.006041
29  -0.007341 -0.551153
..        ...       ...
970  0.995262  0.579724
971 -1.466088 -1.494171
972  0.284913  0.000407
973  2.033499 -0.501377
974  0.009793 -0.329885
975  0.534570  0.390056
976  0.173143  0.008652
977 -0.675305 -0.025662
978 -0.528674  1.527453
979 -2.152348 -0.156541
980 -0.026247 -0.543810
981  0.357833  0.399935
982  0.931239  0.260247
983  0.291362 -0.630381
984 -1.128398 -1.111417
985 -0.046041 -0.797966
986  0.990950 -0.514324
987 -1.136172 -1.296368
988  1.081540  0.176008
989  1.487040 -0.140679
990 -0.820037  1.340490
991 -2.446122 -0.582900
992  1.256650  0.080893
993  1.657169  0.318035
994  0.099596  1.059568
995 -1.181164 -0.979412
996  0.394219  0.633038
997  0.827820 -1.105543
998 -0.025031 -1.752964
999 -0.317448 -0.761225

[1000 rows x 2 columns]

In [25]:
factor=pd.cut(frame.data1, 4)
factor[:10]

0     (0.209, 2.021]
1    (-1.602, 0.209]
2    (-1.602, 0.209]
3    (-1.602, 0.209]
4     (0.209, 2.021]
5    (-1.602, 0.209]
6    (-1.602, 0.209]
7    (-1.602, 0.209]
8     (0.209, 2.021]
9    (-1.602, 0.209]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.421, -1.602] < (-1.602, 0.209] < (0.209, 2.021] < (2.021, 3.832]]

In [26]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}
grouped=frame.data2.groupby(factor)
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.421, -1.602]   53.0  2.563031  0.058196 -1.709515
(-1.602, 0.209]   510.0  3.952120  0.078508 -3.312161
(0.209, 2.021]    408.0  2.652764  0.015865 -2.980330
(2.021, 3.832]     29.0  2.235243 -0.204522 -1.968681

#### 这些都是长度相等的桶，要根据样本分为数得到大小相等的桶，使用qcut即可.

长度相等的桶：区间大小相等 
大小相等的桶：数据点数量相等

In [28]:
grouping=pd.qcut(frame.data1,10,labels=False)#label=false即可值获取分位数的编号
grouped=frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.563031  0.078362 -1.947544
1      100.0  3.406610  0.135297 -2.249373
2      100.0  2.838423  0.113646 -3.312161
3      100.0  2.667990 -0.018533 -2.234768
4      100.0  3.952120  0.095899 -2.263178
5      100.0  2.652764  0.052471 -2.581364
6      100.0  2.503660 -0.041393 -2.980330
7      100.0  2.454031  0.044605 -2.673486
8      100.0  2.316652  0.009178 -2.302590
9      100.0  2.235243 -0.032882 -2.655787

### meshgrid

In [ ]:
x = np.arange(-5, 5, 0.1)
y = np.arange(-5, 5, 0.1)
xx, yy = np.meshgrid(x, y, sparse=Ture)
z = np.sin(xx**2 + yy**2) / (xx**2 + yy**2)
h = plt.contourf(x,y,z)

In [ ]:
nx,ny = (3, 2)
x = np.linspace(0,1,nx)
y = np.linspace(0,1,ny)
print(x, y)

xv, yv = np.meshgrid(x, y, sparse=False, indexing='ij')
xv
yv

In [ ]:
for i in range(nx):
    for j in range(ny):
        print(xv[i,j], yv[i,j])

In [ ]:
from sklearn import tree
X = [[0, 0], [1, 1]]
Y = [0, 1]
clf = tree.DecisionTreeClassifier()
clf = clf.fit(X, Y)

In [ ]:
clf.predict([[2., 2.]])

In [ ]:
clf.predict_proba([[2., 2.]])

In [ ]:
from sklearn.datasets import load_iris
from sklearn import tree
iris = load_iris()
clf = tree.DecisionTreeClassifier()
clf = clf.fit(iris.data, iris.target)

func:`export_graphviz` 出导出还支持各种美化，包括通过他们的类着色节点（或回归值），如果需要，使用显式变量和类名。Jupyter notebook也可以自动找出相同的模块

In [ ]:
import graphviz
#dot_data = tree.export_graphviz(clf, out_file='1.data')
#graph = graphviz.Source(dot_data)

dot_data = tree.export_graphviz(clf, out_file=None,
                            feature_names=iris.feature_names, 
                            class_names=iris.target_names, 
                            filled=True, rounded=True, 
                            special_characters=True) 
graph = graphviz.Source(dot_data) 
graph.render("iris")
graph

In [ ]:
clf.predict(iris.data[:1, :])

In [ ]:
clf.predict_proba(iris.data[:1, :])